#КОМАНДЫ КОТОРЫЕ Я ИСПОЛЬЗУЮ

#import time
#print
#time.sleep(6)
#while True:
# if start_history1 == 'E':   
# elif start_history1 == 'R':    
# break


#Глупая смерть в фентези мире и лохотрон в настоящем  +  Премия дарвина

#||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||   Надеюсь новый год будет лучше чем прошлый
import time
print('ВЫ: Блин, мне так понравилась эта книга , как же наверное интересно было в средневековое время!')
time.sleep(6)

print('Брат заходит в комнату и говорит: Эй мелки, чо делаем?')
time.sleep(4)
#|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| ТО ЧТО Я ЧАЩЕ ВСЕГО БУДУ ИСПОЛЬЗОВАТЬ
while True:
  start_history1 = input('Нажмите на E чтобы ответить брату, либо на R если не хотите этого: ')

  if start_history1 == 'E':
    
    print('ВЫ: Да так ничего. Книгу читал, про средневековье, о том как смелый рыцарь сражался с монстрами, \nзащищал возлюбленную и странствовал по Андросси! Только коментарии плохие про эту книгу, \nговорят конец плохой, по типу: ГГ умер и всё такое, но я до туда еще не дошёл. А ты что-то хотел? ')
    time.sleep(20)
    
  elif start_history1 == 'R':
    print('Вы не захотели говорить с братом и решили снова прочитать книгу, ваш брат ушёл в магазин и не вернулся...')
    break
  #|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| ДИАЛОГ
  print('БРАТ: Да так хотел тебя отправить за чипсиками, давай сходишь, а с меня деньги и то что останется то заберёшь себе.')
  time.sleep(6)
  
  print('ВЫ: Ну уж нет, я не пойду один, у нас на районе маньяк же появился, либо ты со мной либо я не иду!')
  time.sleep(6)

  print('БРАТ: Да чего ты трусишь, нету его уже там давно. ')
  time.sleep(4)

  print('ВЫ: Либо ты со мной, либо сам иди!')
  time.sleep(4)

  print('БРАТ: ЛАДНО, собирайся, пошли вместе, только деньги остануться при мне!')
  time.sleep(5)
  
  print('ВЫ: Ладно.')
  time.sleep(4)

  print('Вы пошли в магаз. \nВы болтали о том что было в книге: ')
  time.sleep(5)
  
  print('БРАТ: Чо хоть в книжке было такого интересного, ты же вроде не любишь читать?')
  time.sleep(5)

  print('ВЫ: Ты чем слушал? Я же говорил, что в книге история о отважном рыцаре который спасает принцессу,\n путешевствует по миру и побеждает врагов!')
  time.sleep(9)
  
  print('БРАТ: И ты серьёзно это читал? Я думал у тебя вкусы по круче.')
  time.sleep(5)
  
  print('ВЫ: Там всё не так просто, это новелла, это типо герой аниме, я тебе просто сократил перессказ \n Он исекайнулся в другой мир, а до этого был обычным парнем. ')
  time.sleep(9)
  
  print('БРАТ: Так вот что, ну это уже похоже на тебя. ')
  time.sleep(4)
  
  print('Вы зашли в тёмный переулок. \n Там вас встретил незнакомец с ножом.')
  time.sleep(4)

  print('Он бежит на вас и вы видите у него в руках нож!!! ')
  time.sleep(4)
  
  start_history2 = input('Нажмите на E чтобы закрыть глаза или R чтобы не закрывать: ')

  if start_history2 == 'E':
    
    print('Вы закрыли глаза, после того как ничего не случилось вы открыли глаза и оказались \nна зелёном лугу.')
    time.sleep(6)
    
  elif start_history2 == 'R':
    print('Вы не закрыли глаза и вас пырнули ножом, брат вмазал ВСРАТОМУ БОМЖУ и вызвал скорую.')
    time.sleep(6)

    print('Скорая приехала через 30 минут после вызова, вы почти сдохли, но вас успели забрать в больничку.')
    time.sleep(4)

    print('Вы выжили, но вас вспороли, вы чуть не сдохли, у вас дырявый желудок и огромный шрам.')
    time.sleep(5)

    print('Но зато вас братом наградили за то, что вы поймали маньяка и выдали вам лям деньжат, которые вы уже потратили на лечение.')
    time.sleep(8)

    print('Получается относительно вы лох, так как вам ничего не дали и вы остались со шрамом на животе, но хотя-бы выжили!!!')
    time.sleep(7)
    break
#|||||||||||||||||||||||||||||||||||||||||||||||| сверху окончание новеллы, а после будет продолжение! я понимаю конечно что маты нельзя но с ними наверно было бы смешнее, но я так не буду делать, всё таки это школа как никак
  
  print('ВЫ: Что?! ГДЕ Я?!')
  time.sleep(4)

  print('БРАТ: Да не ори ты, но вопрос ты правильный задал.')
  time.sleep(5)

  print('ВЫ: БРАТ НЕУЖЕЛИ ЭТО ФЕНТЕЗИ МИР!!!???')
  time.sleep(5)

  print('БРАТ: Э чепуху не неси, не может этого быть!')
  time.sleep(5)

  print('БРАТ: Я в такую хренотень не поверю')
  time.sleep(5)

  print('ВЫ: Ну сам посуди, мы сейчас в поле, непонятно как сдесь оказались. ')
  time.sleep(5)

  print('БРАТ: Не судить я не буду, но и верить в фЕНТЕЗИ МИР ТОЖЕ.')
  time.sleep(6)
  
  print('ВЫ: Стоп, а ты помнишь что произошло? Я лично помню только то, что на нас тот маньяк бежал с ножом. ')
  time.sleep(7)

  print('БРАТ: Ну да, такое и я помню.')
  time.sleep(8)

  print('ВЫ: Ну вот, с героями так всегда, тебя убивают и бог или богиня отправляют тебя в иной мир. ')
  time.sleep(6)
  
  print('БРАТ: Я ГОВОРЮ ЧУШЬ НЕ НЕСИ, ЭТО ВСЁ ФАНТАЗИИ, ТАКОГО БЫТЬ НЕ МОЖЕТ.')
  time.sleep(5)

  print('ВЫ: ДА КАК ТЫ НЕ МОЖЕШЬ ПОНЯТЬ - ЭТО ВСЁ РЕАЛЬНО')
  time.sleep(5)


  print('БРАТ: ДА С ЧЕГО ТЫ ЭТО РЕШИЛ ТО, ВДРУГ МЫ ПРОСТО В ПОЛЕ И ВСЁ ')
  time.sleep(6)

  print('ВЫ: В ПУСТОМ ПОЛЕ ГДЕ НИКОГО НЕТ, ПЛЮС У НАС ТОГДА ВЕЧЕР БЫЛ, А ЗДЕСЬ УТРО!!!  ')
  time.sleep(7)

  print('БРАТ: Ладно, хватит орать, нужно что то делать, у нас не еды, не воды, НИ-ЧЕ-ГО. ')
  time.sleep(7)

  print('ВЫ: Ну думаю город нужно найти, там обычно всё добро находится. ')
  time.sleep(6)

  print('БРАТ: Конечно, мы здесь найдём город, ты вообще по близости его видишь? ')
  time.sleep(6)

  print('ВЫ: Нуу нет... ')
  time.sleep(4)

  print('БРАТ: Ну вот. ')
  time.sleep(4)

  print('ВЫ: В моём рассказе говорилось, что герой целый день странствовал, чтобы найти город. ')
  time.sleep(5)

  print('БРАТ: По твоему я должен в это поверить? ')
  time.sleep(4)

  print('ВЫ: А у нас есть выбор? ')
  time.sleep(3)

  print('БРАТ: .......')
  time.sleep(3)

  print('БРАТ: Видимо нет...')
  time.sleep(4)

  print('ВЫ: Ну вот.')
  time.sleep(3)

  print('БРАТ: Ладно, что у тебя в книге было? ')
  time.sleep(4)

  print('ВЫ: Там говорилось что герой сорвал яблоки с дерева, около которого он появился и пошёл искать людей. ')
  time.sleep(6)

  print('БРАТ: Эээмм... мы и вправду появились около дерева. ')
  time.sleep(5)

  print('ВЫ: Я это тоже заметил. ')
  time.sleep(4)

  print('БРАТ: Ладно, поверю тебе, деваться всё равно не куда.')
  time.sleep(4)

  print('ВЫ: Ну что, будем следовать истории? ')
  time.sleep(5)

  print('БРАТ: А у нас как будто выбор есть? ')
  time.sleep(5)

  print('АВТОР/РАССКАЗЧИК: Ну походу есть. ')
  time.sleep(3)

  start_history3 = input('Нажмите на E чтобы собрать с братом яблоки, либо на R если вы не будите этого делать \nВНИМАНИЕ: последующие выборы будут влиять на концовку игры: ')

  if start_history3 == 'E':
    
    print('Вы взяли яблоки и начали свой путь.  ||||||  + вы не голодали')
    time.sleep(10)
    
  elif start_history3 == 'R':
    
    print('ВЫ: Брат, может не возьмём их, а то мало ли, вдруг они не съедобные.')
    time.sleep(5)
    
    print('БРАТ: Ты уверен? Мы же голодать будем.')
    time.sleep(4)
    
    print('ВЫ: Всё равно. ')
    time.sleep(4)
    
    print('БРАТ: Ну ладно.')
    time.sleep(4)

    print('Вы не собрали яблоки и пошли путешевствовать. |||||||||||| - Вы голодаете.')
    time.sleep(6)
    
    print('Вы проходите примерно 7000 метров, и вы находите нечто, точнее оно вас находит...')
    time.sleep(6)
  
    print('ОГРОМНЫЙ ВОЛК-МОНСТР НАПАДАЕТ НА ВАС.')
    time.sleep(3)

    print('Вы отбиваетесь от него, но у вас нет сил, ТАК КАК ВЫ НЕ ВЗЯЛИ С СОБОЙ ЯБЛОКИ!!! ')
    time.sleep(4)

    print('вы умираете, но не совсем.')
    time.sleep(4)
  
    print('ВЫ всё это время были в коме, а точнее целую неделю, Вы выжили, но вас вспороли, вы чуть не сдохли, у вас дырявый желудок и огромный шрам.')
    time.sleep(8)

    print('Но зато вас братом наградили за то, что вы поймали маньяка и выдали вам лям деньжат, которые вы уже потратили на лечение.')
    time.sleep(8)

    print('Получается относительно вы лох, так как вам ничего не дали и вы остались со шрамом на животе, но хотя-бы выжили!!!')
    time.sleep(7)
    break
  

  print('БРАТ: Нормальные яблоки, даже вкуснее обычных.')
  time.sleep(5)

  print('ВЫ: Ага, слаще что-ли?')
  time.sleep(3)
  
  print('Вы проходите примерно 7000 метров, и вы находите нечто, точнее оно вас находит...')
  time.sleep(6)
  
  print('ОГРОМНЫЙ ВОЛК-МОНСТР НАПАДАЕТ НА ВАС.')
  time.sleep(3)

  print('Он нападает на вас, но вы еле как отбрасываете его от себя, брат находит острый колл и прокалывает сердце волку. ')
  time.sleep(6)
  
  print('УВЕДОМЛЕНИЕ СИСТЕМЫ МИРА: \n|ВЫ ПОЛУЧИЛИ ШЕРСТЬ КАМНЕ ВОЛКА ВЫ ПОЛУЧИЛИ КЛЫКИ   \n|ВЫ ПОЛУЧИЛИ КЛЫКИ КАМНЕ ВОЛКА(ОНИ ИСПОЛЬЗУЮТСЯ В СОЗДАНИИ ОРУЖИЯ)  \n|ВЫ ПОЛУЧИЛИ МЯСО КАМНЕ ВОЛКА(ОНО ИСПОЛЬЗУЕТСЯ В ГОТОВКЕ)')
  time.sleep(9)
  

  print('ВЫ: Ничего себе, всё как в том ренобэ, это так классно.')
  time.sleep(5)

  print('БРАТ: КАКОЙ НАФИГ КЛАССНО, ТЫ ИДИОТ, ТЕБЯ ЧУТЬ ВОЛК С КАМЕННЫМ ГОРБОМ НЕ УБИЛ.')
  time.sleep(7)

  print('ВЫ: НО ВСЁ ЖЕ КЛАССНО!')
  time.sleep(3)

  print('БРАТ: С кем я жил всё это время?')
  time.sleep(3)
  
  print('ВЫ: Со мной, это ты на что намекаешь?')
  time.sleep(4)
  
  print('БРАТ: Да так, на то что ты идиот помешанный на играх, аниме и манге.\nТЫ ПОНИМАЕШЬ ЧТО НАС ЧУТЬ НЕ СЪЕЛИ И СЧИТАЕШЬ ЭТО КЛАССНЫМ?')
  time.sleep(8)
  
  print('ВЫ: ДУМАЕШЬ Я НЕ ИСПУГАЛСЯ!? ПРОСТО МЕНЯ ПОРАЖАЕТ ТО, ЧТО ИСТОРИЯ ПОВТОРЯЕТСЯ!')
  time.sleep(6)
  
  print('БРАТ: Типо ты хочешь чказать что ты в шоке но и одновременно рад? Хотя какая мне разница,\nлучше пошли побыстрее, а то опять наткнёмся на него')
  time.sleep(10)

  print('ВЫ: Ну в этом ты прав, пошли быстрее.')
  time.sleep(6)

  print('Вы дошли до города')
  time.sleep(4) 

  print('ВЫ: Нус куда пойдём в первую очередь?')
  time.sleep(4)

  print('БРАТ: А какой у нас выбор?')
  time.sleep(3)
  print('ВЫ: Ну мы можем пойти в таверну или сразу в гильдию авантюристов.')
  time.sleep(5)

  start_history4 = input('Нажмите на E чтобы пойти в гильдию, либо на R чтобы пойти в таверну.  \nВНИМАНИЕ: последующие выборы будут влиять на концовку игры: ')

  if start_history4 == 'E':
    
    print('Вы пошли в гильдию авонтюристов.')
    time.sleep(4)

  elif start_history4 == 'R':
    print('В пошли в таверну.')
    time.sleep(5)
    
    print('Сдесь вы встретили очень много людей авантюристов, воров и эльфов с маг-зверями. ')
    time.sleep(6)
    
    print('Вас просит выйти в закаулок эльф в лохмотьях. ')
    time.sleep(4)
    
    print('Вы по какой-то причине ему поверили после чего он вас пырнул и забрал яблоки и всё что у вас было. ')
    time.sleep(6)
    
    print('Как сказал бы я-Рассказчик: Я уже говорил тебе, что такое безумие, а? Безумие--это точное повторение\nодного и того же действия. Раз за разом, в надежде на изменение. Это есть безумие.\nКогда впервые я это услышал, не помню, кто сказал эту хрень, я. ')
    time.sleep(6)

    print('ВЫ всё это время были в коме, а точнее целую неделю, Вы выжили, но вас вспороли, вы чуть не сдохли, у вас дырявый желудок и огромный шрам.')
    time.sleep(8)

    print('Но зато вас братом наградили за то, что вы поймали маньяка и выдали вам лям деньжат, которые вы уже потратили на лечение.')
    time.sleep(8)

    print('Получается относительно вы лох, так как вам ничего не дали и вы остались со шрамом на животе, но хотя-бы выжили!!!')
    time.sleep(7)
  break


print('Вам дали задание убить монстров. ')
time.sleep(4)

print('БРАТ: И как мы будем убивать гоблинов а? У нас ни магии не оружия ничего. ')
time.sleep(6)

print('ВЫ: Я не знаю, может быть у кого нибудь попросим оружие или украдём? ')
time.sleep(6)

print('БРАТ: Так, что у тебя по сюжету а? Что дальше в книге было? ')
time.sleep(5)

print('ВЫ: Тут ткое дело, вместе с героем заспавнился и меч, но у нас такого нет и я не знаю что делать... ')
time.sleep(7)

print('БРАТ: ЧУДЕСНО! НАМ ЖЕ ДЕНЬГИ ЗАРАБАТЫВАТЬ ЧЕМ !? Как вы вообще тут окозались')
time.sleep(7)

print('ВЫ: Хз, и то и то я не знаю. ')
time.sleep(3)

print('БРАТ: Ладно. ')
time.sleep(3)

print('Вы видите лежащий красивый меч. ')
time.sleep(3)

print('ВЫ: Бро ну тут нам судьба сама говорит, бери его и побеждай! ')
time.sleep(5)

print('БРАТ: Так давай без кражи, пошли уже, что нибудь да придумаем. ')
time.sleep(6)

print('Ваш брат начал выходить из города, но вы решили забрать меч. ')
time.sleep(6)

print('Перед тем как сказать фразу ТЫ ЗАЧЕМ ЕГО ВЗЯЛ!!! на вас напали гоблины.')
time.sleep(6)

print('Вы не успели ударить их мечом, так как он был очень тяжёлый и вас убили. Но.... ')
time.sleep(6)

print('ВЫ всё это время были в коме, а точнее целую неделю, Вы выжили, но вас вспороли, вы чуть не сдохли, у вас дырявый желудок и огромный шрам.')
time.sleep(5)

print('Но зато вас братом наградили за то, что вы поймали маньяка и выдали вам лям деньжат, которые вы уже потратили на лечение.')
time.sleep(8)

print('Получается относительно вы лох, так как вам ничего не дали и вы остались со шрамом на животе, но хотя-бы выжили!!!')
time.sleep(7)

 
  #|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||Не успел я к срокам по этому такой худй конец